# Crear un DataFrame

In [3]:
import pandas as pd

In [4]:
data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana'],
        'Edad': [25, 30, 22, 28],
        'Ciudad': ['Madrid', 'Barcelona', 'Sevilla', 'Valencia']}

df = pd.DataFrame(data)

In [5]:
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    22    Sevilla
3    Ana    28   Valencia

# Seleccionar Datos

In [8]:
#Selecciona solo las filas del DataFrame donde la edad sea mayor que 25.

edad = df[df["Edad"]>25]

edad

  Nombre  Edad     Ciudad
1  María    30  Barcelona
3    Ana    28   Valencia

# Filtrar Datos

In [10]:
#Filtra el DataFrame para mostrar solo las filas donde la ciudad sea 'Madrid' o 'Barcelona'

filtrado = df[(df["Ciudad"]=="Madrid") | (df["Ciudad"] == "Barcelona")]

filtrado

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

# Agregar una Columna

In [13]:
#Agrega una nueva columna llamada 'Altura' al DataFrame con los valores [175, 160, 180, 165].

df["Altura"] = [175, 160, 180, 165]

In [12]:
df

  Nombre  Edad     Ciudad  Altura
0   Juan    25     Madrid     175
1  María    30  Barcelona     160
2  Pedro    22    Sevilla     180
3    Ana    28   Valencia     165

# Modificar Datos

In [14]:
#Cambia la edad de 'María' a 32 en el DataFrame.

df["Edad"].replace(30,32,inplace = True)

In [15]:
df

  Nombre  Edad     Ciudad  Altura
0   Juan    25     Madrid     175
1  María    32  Barcelona     160
2  Pedro    22    Sevilla     180
3    Ana    28   Valencia     165

# Resumen Estadístico

In [16]:
#Calcula estadísticas descriptivas para la columna 'Edad' (media, mediana, mínimo, máximo, etc.).

df.describe()

            Edad      Altura
count   4.000000    4.000000
mean   26.750000  170.000000
std     4.272002    9.128709
min    22.000000  160.000000
25%    24.250000  163.750000
50%    26.500000  170.000000
75%    29.000000  176.250000
max    32.000000  180.000000

# Ordenar Datos

In [20]:
#Ordena el DataFrame por la columna 'Edad' de forma descendente

df= df.sort_values(by = "Edad",ascending = False)

df

  Nombre  Edad     Ciudad  Altura
1  María    32  Barcelona     160
3    Ana    28   Valencia     165
0   Juan    25     Madrid     175
2  Pedro    22    Sevilla     180

# Agrupar y Calcular

In [21]:
#Agrupa el DataFrame por la columna 'Ciudad' y calcula la media de la edad para cada ciudad.

media_edad_por_ciudad = df.groupby("Ciudad")["Edad"].mean()

media_edad_por_ciudad

Ciudad
Barcelona    32.0
Madrid       25.0
Sevilla      22.0
Valencia     28.0
Name: Edad, dtype: float64

# Guardar y Cargar

In [22]:
df.to_csv("datos.csv",index = False)

df_nuevo = pd.read_csv("datos.csv")

df_nuevo

  Nombre  Edad     Ciudad  Altura
0  María    32  Barcelona     160
1    Ana    28   Valencia     165
2   Juan    25     Madrid     175
3  Pedro    22    Sevilla     180